---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionLProfileWithLips
source: html/3a08f29a-8b2c-0e66-f863-03e04099f371.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionLProfileWithLips

Defines parameters for L Profile with lips structural section.

## Syntax (C#)
```csharp
public class StructuralSectionLProfileWithLips : StructuralSectionGeneralLA
```